Import relevant libraries

In [2]:
import numpy as np
import pandas as pd
from scipy import stats

Load datasets

In [11]:
marketing_sample1 = pd.read_csv("marketing_campaign_concat1.csv")
marketing_sample2 = pd.read_csv("marketing_campaign_concat2.csv")

Inspect the datasets

In [12]:
marketing_sample1.shape

(2240, 5)

In [13]:
marketing_sample1.head()

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0

In [14]:
marketing_sample2.shape

(2240, 5)

In [15]:
marketing_sample2.head()

,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,3,8,10,4,7
1,2,1,1,2,5
2,1,8,2,10,4
3,2,2,0,4,6
4,5,5,3,6,5

Concatenate(combine) the two datasets into one new dataset

In [ ]:
concatenated_data = pd.concat([marketing_sample1, marketing_sample2], axis = 1)
# axis = 1, it will combine column wise axis = 0 it will combine row wise

In [17]:
concatenated_data.shape

(2240, 10)

In [18]:
concatenated_data.head()

,ID,Year_Birth,Education,Marital_Status,Income,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,3,8,10,4,7
1,2174,1954,Graduation,Single,46344.0,2,1,1,2,5
2,4141,1965,Graduation,Together,71613.0,1,8,2,10,4
3,6182,1984,Graduation,Together,26646.0,2,2,0,4,6
4,5324,1981,PhD,Married,58293.0,5,5,3,6,5

In [ ]:
# axis = 0 it will combine row wise 
concatenated_data = pd.concat([marketing_sample1, marketing_sample2], axis = 0)
concatenated_data.head()

,ID,Year_Birth,Education,Marital_Status,Income,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,5524.0,1957.0,Graduation,Single,58138.0,NaN,NaN,NaN,NaN,NaN
1,2174.0,1954.0,Graduation,Single,46344.0,NaN,NaN,NaN,NaN,NaN
2,4141.0,1965.0,Graduation,Together,71613.0,NaN,NaN,NaN,NaN,NaN
3,6182.0,1984.0,Graduation,Together,26646.0,NaN,NaN,NaN,NaN,NaN
4,5324.0,1981.0,PhD,Married,58293.0,NaN,NaN,NaN,NaN,NaN